

void main () {
// int a = 10 ;НОМЕР 1

// if (a == 10){ 
//   print('верно');
// }else if (a == 10){
//   print('неверно');
// }else {
//   print(Error());
// }

// int a =3443; НОМЕР 2
// if (a ==1231){
//   print ('верно');
// }else if (a == 1231){
// }else {
//   print ('неверно');
// } 

// if(a >123){
//   print('$a больше 123');
// }if (a < 9231){
//   print('$a меньше 9231');
// }if (a > 52){
//   print('$a больше 52 ');
// }

// int a =36423; 
//  if (a ==4126){
//   print ('верно');
// }else if (a == 4126){
// }else {
//   print ('неверно');
// } 

// if(a > 3526){
//   print('$a больше 3526');
// }if (a < 9821){
//   print('$a меньше 9821');
// }if (a > 5424){
//   print('$a больше 5424 ');
// }if (a < 812718){
//   print ('$a больше 812718 ');
// }

// int a =36423; 
//  if (a ==4126){
//   print ('верно');
// }else if (a == 4126){
// }else {
//   print ('неверно');
// } 

// if(a > 3526){
//   print('$a больше 3526');
// }if (a < 9821){
//   print('$a меньше 9821');
// }if (a > 5424){
//   print('$a больше 5424 ');
// }if (a < 812718){
//   print ('$a больше 812718 ');
// }

// int a =36423; 
//  if (a ==4126){
//   print ('верно');
// }else if (a == 4126){
// }else {
//   print ('неверно');
// } 

// if(a > 3526){
//   print('$a больше 3526');
// }if (a < 9821){
//   print('$a меньше 9821');
// }if (a > 5424){
//   print('$a больше 5424 ');
// }if (a < 812718){
//   print ('$a больше 812718 ');
// }

// int a =36423; 
//  if (a ==4126){
//   print ('верно');
// }else if (a == 4126){
// }else {
//   print ('неверно');
// } 

// if(a > 3526){
//   print('$a больше 3526');
// }if (a < 9821){
//   print('$a меньше 9821');
// }if (a > 5424){
//   print('$a больше 5424 ');
// }if (a < 812718){
//   print ('$a больше 812718 ');
// }

// int a =36423; 
//  if (a == 'сто '){
//   print ('верно');
// }else if (a == 'сто'){
// }else {
//   print ('неверно');
// } 

// if(a > 85){
//   print('$a больше восемьдесятьпять');
// }if (a > 5424){
//   print('$a больше десять ');
// }if (a < 812718){
//   print ('$a больше 812718 ');
// }

// int a =1221; 
//  if (a ==8282){
//   print ('верно');
// }else if (a == 8282){
// }else {
//   print ('неверно');
// } 

// if(a > 747){
//   print('$a больше 747');
// }if (a < 982){
//   print('$a меньше 1982');
// }if (a < 8127){
//   print ('$a больше 8127 ');
// }


String palindrom = ('toma toma toma');
 
if (palindrom.isNotEmpty) {
  print('томат');
}else{
print('томагавк');
}

palindrom =='toma toma toma'? print('томат'): print('томагавк');

}